# Module 9: Data Manipulation I 

Datasets rarely come perfectly ready for analysis. Sometimes they need a little cleaning up, modification, or adjustment to meet the needs of your analyses. In our first lesson on data manipulation, you will learn some of the basic tools in making minor adjustments to your dataset. 

***************

In [4]:
import pandas as pd
import numpy as np

## Creating Data From Scratch

Datasets are an organized series of lists of information. We can use what we've learned about dictionaries to quickly create a series of labels and values that can be turned into a dataset. This will allow you to see the information in a structured and organized way, but it also allows for the application of pandas functions on this new dataset.

In [6]:
## Step 1: Create a dictionary with you key-value pairs

## xyz = {"key1":"value1", }

## KEY = the column header; this is the name of your column in the new dataset
## VALUE = the values that will be included in the column; this will be a list

dictionary1 = {'First Score':[100, 90, 89, 95], 'Second Score': [30, 45, 56, 67], 'Third Score':[78, 40, 80, 98]}

In [7]:
## Step 2: Convert the dictionary to a pandas dataframe

df = pd.DataFrame(dictionary1)

In [8]:
## Step 3: Check your new dataset

df.head()

   First Score  Second Score  Third Score
0          100            30           78
1           90            45           40
2           89            56           80
3           95            67           98

## { Exercise 1 }

Create a dataset (name it whatever you like) with the following columns:
* TV Shows
* Movies
* Snacks

Make sure each column has at least four observations.

In [11]:
my_dict = {'tv Shows':["Game of Thrones", "Vou100", 90, 89], 'Second Score': [30, 45, 56, 67], 'Third Score':[78, 40, 80, 98]}

In [12]:
df = pd.DataFrame(my_dict)

In [14]:
df

          tv Shows  Second Score  Third Score
0  Game of Thrones            30           78
1           Vou100            45           40
2               90            56           80
3               89            67           98

## Importing Libraries

In [20]:
import pandas as pd
import numpy as np

## Finding & Handling Missing Data

Missing data is something that always needs to be accessed when you are working with a new dataset. Missing data is missing information and creates gaps in your dataset. For certain functions and analyses, you cannot have any missing data. Luckily, you are able to handle the missing data in several ways.

In [22]:
## creating a dataset to practice with

dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport':["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)
df.head()

      Name       Sport  Score
0    James    Baseball    NaN
1  Patrick      Tennis   40.0
2      NaN      Soccer   80.0
3   Cassie         NaN    NaN
4    Mario  Basketball   78.0

***

### Locating Missing Data

***

In [17]:
## checking which rows have missing data and how much data is missing

df.isnull().sum()

Name     1
Sport    1
Score    2
dtype: int64

In [18]:
## where are the rows that have missing data?

df.loc[df.isnull().any(axis = 1)]

## any() function: the any looks for any true value across an axis
## axis = 1 means the columns - the function will look at each row across each column
## if any of the columns have ONE missing value, the row will be returned

     Name     Sport  Score
0   James  Baseball    NaN
2     NaN    Soccer   80.0
3  Cassie       NaN    NaN

In [19]:
## where are the rows that have missing data in a specific column?

df.loc[df["Sport"].isnull()]

     Name Sport  Score
3  Cassie   NaN    NaN

***

### Removing Missing Data

***

#### What does it mean to make a change "inplace"?

When inplace = True, the data is modified in place (the dataset is permanently updated). When inplace = False (this is the default operation), the operation is performed and a <b>copy</b> of the modified dataset is returned, but the original dataset remains unchanged.

In [23]:
## creating a dataset to practice with

dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport':["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)
df.head()

      Name       Sport  Score
0    James    Baseball    NaN
1  Patrick      Tennis   40.0
2      NaN      Soccer   80.0
3   Cassie         NaN    NaN
4    Mario  Basketball   78.0

#### Removing All Missing Data

In [24]:
## dropping all rows with at least one missing value

df.dropna(inplace = True)

## check the changes

df.head()

      Name       Sport  Score
1  Patrick      Tennis   40.0
4    Mario  Basketball   78.0

#### Removing Specific Missing Data

In [25]:
dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport': ["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)

### dropping all rows with at least one missing value in a certain column

df.dropna(subset=["Name"], inplace = True)

## check the changes

df.head()

      Name       Sport  Score
0    James    Baseball    NaN
1  Patrick      Tennis   40.0
3   Cassie         NaN    NaN
4    Mario  Basketball   78.0

Good Practice for Working with Data

* before modifying your dataset too much, make a copy to work with so you always have the original handy if you need it
* if you want to see what the change will look like, but don't want it to be perm

In [26]:
dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport': ["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)

df.head()

      Name       Sport  Score
0    James    Baseball    NaN
1  Patrick      Tennis   40.0
2      NaN      Soccer   80.0
3   Cassie         NaN    NaN
4    Mario  Basketball   78.0

In [31]:
df.dropna() ## without inplace=True

      Name       Sport  Score
1  Patrick      Tennis   40.0
4    Mario  Basketball   78.0

In [27]:
## make a copy of your dataset to use instead of the original 

df2 = df.copy()

df2.head()

      Name       Sport  Score
0    James    Baseball    NaN
1  Patrick      Tennis   40.0
2      NaN      Soccer   80.0
3   Cassie         NaN    NaN
4    Mario  Basketball   78.0

In [32]:
df2.dropna(inplace=True)

In [33]:
df2.head()

      Name       Sport  Score
1  Patrick      Tennis   40.0
4    Mario  Basketball   78.0

In [34]:
## help with function

df.dropna?

***

### Replacing Missing Data

***

In [35]:
dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport': ["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)

#### fill all missing data values with a value of your choosing

df.fillna(999, inplace = True)

# check changes

df.head()

      Name       Sport  Score
0    James    Baseball  999.0
1  Patrick      Tennis   40.0
2      999      Soccer   80.0
3   Cassie         999  999.0
4    Mario  Basketball   78.0

#### Replacing Specific Missing Data

In [36]:
dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport': ["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)

#### fill specific missing data values with a value of your choosing

df["Name"].fillna("Unknown", inplace = True)

# check changes

df.head()

      Name       Sport  Score
0    James    Baseball    NaN
1  Patrick      Tennis   40.0
2  Unknown      Soccer   80.0
3   Cassie         NaN    NaN
4    Mario  Basketball   78.0

In [37]:
dict1 = {'Name':["James", "Patrick", np.nan, "Cassie", "Mario"],
        'Sport': ["Baseball", "Tennis", "Soccer", np.nan, "Basketball"],
        'Score':[np.nan, 40, 80, np.nan, 78]}

df = pd.DataFrame(dict1)

## fill specific missing values with summary statistic
## replace the missing score value with the average score for the entire group

# what is the average?
print("The average score is:", df["Score"].mean())

# use that value to fill in the missing value
df["Score"].fillna(df["Score"].mean(), inplace = True)

# check changes
df.head()

The average score is: 66.0

      Name       Sport  Score
0    James    Baseball   66.0
1  Patrick      Tennis   40.0
2      NaN      Soccer   80.0
3   Cassie         NaN   66.0
4    Mario  Basketball   78.0

## { Exercise 2 }

Run the code to create a dataset of weather conditions in specific areas. Then find and handle all the missing data in the dataset.

In [76]:
## Weather Dataset

weather = {'Season':["Spring", "Spring", np.nan, "Summer", "Fall", "Winter", "Summer", "Summer", "Winter"],
            'Temp':[90, 71, np.nan, 102, 68, np.nan, 99, 87, np.nan],
            'Conditions':["Rain", "Thunderstorms", "Rain", "Sunny", "Partly Cloudy", np.nan, "Cloudy", np.nan, "Blizzard"]}

df = pd.DataFrame(weather)

df

   Season   Temp     Conditions
0  Spring   90.0           Rain
1  Spring   71.0  Thunderstorms
2     NaN    NaN           Rain
3  Summer  102.0          Sunny
4    Fall   68.0  Partly Cloudy
5  Winter    NaN            NaN
6  Summer   99.0         Cloudy
7  Summer   87.0            NaN
8  Winter    NaN       Blizzard

1. Write the code to show how much missing data is in each column.

In [77]:
df.isnull().sum()

Season        1
Temp          3
Conditions    2
dtype: int64

2. Using loc - return the rows that have any missing data.

In [78]:
df.loc[df.isnull().any(axis = 1)]

   Season  Temp Conditions
2     NaN   NaN       Rain
5  Winter   NaN        NaN
7  Summer  87.0        NaN
8  Winter   NaN   Blizzard

3. Drop the rows that have missing data in "Season" column.

In [79]:
df.dropna(subset = ["Season"], inplace = True)

## check the changes

df.head()

   Season   Temp     Conditions
0  Spring   90.0           Rain
1  Spring   71.0  Thunderstorms
3  Summer  102.0          Sunny
4    Fall   68.0  Partly Cloudy
5  Winter    NaN            NaN

4. Replace the missing data in the "Conditions" column with the word "UNKNOWN"

In [80]:
df["Conditions"].fillna("Unknown", inplace = True)
df

   Season   Temp     Conditions
0  Spring   90.0           Rain
1  Spring   71.0  Thunderstorms
3  Summer  102.0          Sunny
4    Fall   68.0  Partly Cloudy
5  Winter    NaN        Unknown
6  Summer   99.0         Cloudy
7  Summer   87.0        Unknown
8  Winter    NaN       Blizzard

5. Replace the missing data in the "Temp" column with the average temperature of the entire dataset.

In [81]:
df['Temp'].fillna(df["Temp"].mean(), inplace = True)
df

   Season        Temp     Conditions
0  Spring   90.000000           Rain
1  Spring   71.000000  Thunderstorms
3  Summer  102.000000          Sunny
4    Fall   68.000000  Partly Cloudy
5  Winter   86.166667        Unknown
6  Summer   99.000000         Cloudy
7  Summer   87.000000        Unknown
8  Winter   86.166667       Blizzard

## Finding & Handling Duplicate Rows

Duplicate data is typically an error in data entry - the same information is getting entered more than once. Duplicate rows can be just as messy for analyses as missing data. You should take the time to determine if you have any duplicate rows in your dataset - and if you do, they should be removed.

In [56]:
## creating a dataset to practice with

paint = {'Paint_Brand':["Benjamin Moore", "Behr", "Sherwin-Williams", "Kilz", "Valspar", "Sherwin-Williams", "Kilz"],
        'Color': ["Beige", "Navy", "Cream", "Grey", "Soft Teal", "Cream", "Grey"],
        'Wall_Location':["Entryway", "Master Bedroom", "Kitchen", "Basement", "Living Room", "Kitchen", "Basement"]}

df = pd.DataFrame(paint)
df

        Paint_Brand      Color   Wall_Location
0    Benjamin Moore      Beige        Entryway
1              Behr       Navy  Master Bedroom
2  Sherwin-Williams      Cream         Kitchen
3              Kilz       Grey        Basement
4           Valspar  Soft Teal     Living Room
5  Sherwin-Williams      Cream         Kitchen
6              Kilz       Grey        Basement

***

### Identifying Duplicate Rows

***

In [57]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [58]:
## locate duplicate rows 

df.loc[df.duplicated()]

        Paint_Brand  Color Wall_Location
5  Sherwin-Williams  Cream       Kitchen
6              Kilz   Grey      Basement

In [ ]:
df.loc[df["Paint_Brand"] == "Sherwin-Williams"]

In [60]:
## drop duplicate rows

df.drop_duplicates(inplace = True)

# check work

df

        Paint_Brand      Color   Wall_Location
0    Benjamin Moore      Beige        Entryway
1              Behr       Navy  Master Bedroom
2  Sherwin-Williams      Cream         Kitchen
3              Kilz       Grey        Basement
4           Valspar  Soft Teal     Living Room

## Adding & Removing Columns from Dataset

You have a lot of flexibility with what you can do with your pandas dataset once its defined. Adding columns allows you to create new data that may not have originated in your starting data file. It also allows you to create columns based on other columns or conditions. Removing columns allows you to remove unneeded information from your dataset which might be taking up space.

***

### Creating New Columns

***

In [61]:
## create a new column and assign a single value

df["Quantity"] = 3

df.head()

        Paint_Brand      Color   Wall_Location  Quantity
0    Benjamin Moore      Beige        Entryway         3
1              Behr       Navy  Master Bedroom         3
2  Sherwin-Williams      Cream         Kitchen         3
3              Kilz       Grey        Basement         3
4           Valspar  Soft Teal     Living Room         3

In [62]:
## create a new column 

df["Price"] = 29.99

df.head()

        Paint_Brand      Color   Wall_Location  Quantity  Price
0    Benjamin Moore      Beige        Entryway         3  29.99
1              Behr       Navy  Master Bedroom         3  29.99
2  Sherwin-Williams      Cream         Kitchen         3  29.99
3              Kilz       Grey        Basement         3  29.99
4           Valspar  Soft Teal     Living Room         3  29.99

In [63]:
## create a new column and assign everything to missing

df["Total"] = np.nan

df.head()

        Paint_Brand      Color   Wall_Location  Quantity  Price  Total
0    Benjamin Moore      Beige        Entryway         3  29.99    NaN
1              Behr       Navy  Master Bedroom         3  29.99    NaN
2  Sherwin-Williams      Cream         Kitchen         3  29.99    NaN
3              Kilz       Grey        Basement         3  29.99    NaN
4           Valspar  Soft Teal     Living Room         3  29.99    NaN

***

### Creating New Column based on other Columns

***

In [64]:
## create a new column based on another column

df["Total_Cost"] = df["Quantity"] * df["Price"]

df.head()

,Paint_Brand,Color,Wall_Location,Quantity,Price,Total,Total_Cost
0,Benjamin Moore,Beige,Entryway,3,29.99,NaN,89.97
1,Behr,Navy,Master Bedroom,3,29.99,NaN,89.97
2,Sherwin-Williams,Cream,Kitchen,3,29.99,NaN,89.97
3,Kilz,Grey,Basement,3,29.99,NaN,89.97
4,Valspar,Soft Teal,Living Room,3,29.99,NaN,89.97

***

### Removing Columns

***

In [65]:
## drop a single column

df.drop(columns = "Total", inplace = True)

df.head()

        Paint_Brand      Color   Wall_Location  Quantity  Price  Total_Cost
0    Benjamin Moore      Beige        Entryway         3  29.99       89.97
1              Behr       Navy  Master Bedroom         3  29.99       89.97
2  Sherwin-Williams      Cream         Kitchen         3  29.99       89.97
3              Kilz       Grey        Basement         3  29.99       89.97
4           Valspar  Soft Teal     Living Room         3  29.99       89.97

In [66]:
## drop multiple columns

df.drop(columns = ["Quantity", "Price"], inplace = True)

df.head()

        Paint_Brand      Color   Wall_Location  Total_Cost
0    Benjamin Moore      Beige        Entryway       89.97
1              Behr       Navy  Master Bedroom       89.97
2  Sherwin-Williams      Cream         Kitchen       89.97
3              Kilz       Grey        Basement       89.97
4           Valspar  Soft Teal     Living Room       89.97

***

### Creating New Columns based on Conditions

***

In [82]:
## creating a dataset to practice with

grades = {'Student':["Taylor", "Carlos", "Sherrie", "Mary", "Henry", "Michael", "June"],
        'Grades': [89, 99, 100, 79, 81, 78, 97],
        'Subject':["Math", "English", "Studio Art", "Biology", "Chemistry", "Latin", "Physics"]}

df = pd.DataFrame(grades)
df

   Student  Grades     Subject
0   Taylor      89        Math
1   Carlos      99     English
2  Sherrie     100  Studio Art
3     Mary      79     Biology
4    Henry      81   Chemistry
5  Michael      78       Latin
6     June      97     Physics

In [83]:
## create a new column based on the condition of another column

## df[new col] = np.where(condition, outcome a, outcome b)

## the np.where function returns elements based on a condition
## np.where(condition, outcome a, outcome b)
## condition = whatever condition you want to search for 
## outcome a = what to do when the condition is true
## outcome b = what to do when the condition is false

df["Pass_Fail"] = np.where(df["Grades"] >= 80, "Passed", "Failed")

# check your work

df

   Student  Grades     Subject Pass_Fail
0   Taylor      89        Math    Passed
1   Carlos      99     English    Passed
2  Sherrie     100  Studio Art    Passed
3     Mary      79     Biology    Failed
4    Henry      81   Chemistry    Passed
5  Michael      78       Latin    Failed
6     June      97     Physics    Passed

In [84]:
## create a new column based on multiple conditions

## df[new col] = np.where(((condition1) & (condition2)), outcome1, outcome2)

## the np.where function returns elements based on a condition
## np.where(condition, outcome a, outcome b)
## condition = whatever condition you want to search for 
## outcome a = what to do when the condition is true
## outcome b = what to do when the condition is false

df["Honor_Role"] = np.where(((df["Pass_Fail"] == "Passed") & (df["Grades"] > 89)), 1, 0)

# check your work

df

   Student  Grades     Subject Pass_Fail  Honor_Role
0   Taylor      89        Math    Passed           0
1   Carlos      99     English    Passed           1
2  Sherrie     100  Studio Art    Passed           1
3     Mary      79     Biology    Failed           0
4    Henry      81   Chemistry    Passed           0
5  Michael      78       Latin    Failed           0
6     June      97     Physics    Passed           1

## { Exercise 3 }

Run the code below to create a dataset about vacation packages. After you create the dataset, answer the questions below.

In [85]:
## Vacation Data

vaca = {'Country_Destination':["Barbados", "Mexico", "Australia", "Aruba", "Greece", "France", "France"],
            'Inclusive': ["Y", "N", "Y", "Y", "N", "Y", "Y"],
            'Price_per_Person':[1098.00, 679.99, 2035.69, 1789.00, 899.00, 1650.89, 1650.89], 
            'Family_Size':[2, 4, 1, 6, 5, 3, 3],
            'Travel_Month':["June", "September", "April", "November", "August", "December", "December"]}

df = pd.DataFrame(vaca)

df

  Country_Destination Inclusive  Price_per_Person  Family_Size Travel_Month
0            Barbados         Y           1098.00            2         June
1              Mexico         N            679.99            4    September
2           Australia         Y           2035.69            1        April
3               Aruba         Y           1789.00            6     November
4              Greece         N            899.00            5       August
5              France         Y           1650.89            3     December
6              France         Y           1650.89            3     December

1. Identify and remove the duplicate row(s)

In [94]:
df.duplicated()
df.drop_duplicates(inplace = True)
df

,Country_Destination,Inclusive,Price_per_Person,Family_Size,Travel_Month,Travel_Insurance
0,Barbados,Y,1098.00,2,June,Y
1,Mexico,N,679.99,4,September,Y
2,Australia,Y,2035.69,1,April,Y
3,Aruba,Y,1789.00,6,November,Y
4,Greece,N,899.00,5,August,Y
5,France,Y,1650.89,3,December,Y

2. Add a column to the dataset called "Travel_Insurance" -- all the values in the column should be "Y"

In [95]:
df["Travel_Insurance"] = "Y"
df

,Country_Destination,Inclusive,Price_per_Person,Family_Size,Travel_Month,Travel_Insurance
0,Barbados,Y,1098.00,2,June,Y
1,Mexico,N,679.99,4,September,Y
2,Australia,Y,2035.69,1,April,Y
3,Aruba,Y,1789.00,6,November,Y
4,Greece,N,899.00,5,August,Y
5,France,Y,1650.89,3,December,Y

3. Add a column to the dataset called "Price_per_Family" -- multiply the "Price_per_Person" column with the "Family_Size" column

In [97]:
df["Price_per_Family"] = df["Price_per_Person"] * df["Family_Size"]
df.head()

,Country_Destination,Inclusive,Price_per_Person,Family_Size,Travel_Month,Travel_Insurance,Price_per_Family
0,Barbados,Y,1098.00,2,June,Y,2196.00
1,Mexico,N,679.99,4,September,Y,2719.96
2,Australia,Y,2035.69,1,April,Y,2035.69
3,Aruba,Y,1789.00,6,November,Y,10734.00
4,Greece,N,899.00,5,August,Y,4495.00

4. Add a new column called "Peak Season" -- if the Travel month is a summer month, "Peak Season" should have a value of "Y", otherwise, it should have a value of "N".

In [103]:
df["Peak Season"] = np.where(((df["Travel_Month"] == "June") | (df["Travel_Month"] == "September")), "Y", "N")
df

,Country_Destination,Inclusive,Price_per_Person,Family_Size,Travel_Month,Travel_Insurance,Price_per_Family,Peak Season
0,Barbados,Y,1098.00,2,June,Y,2196.00,Y
1,Mexico,N,679.99,4,September,Y,2719.96,Y
2,Australia,Y,2035.69,1,April,Y,2035.69,N
3,Aruba,Y,1789.00,6,November,Y,10734.00,N
4,Greece,N,899.00,5,August,Y,4495.00,N
5,France,Y,1650.89,3,December,Y,4952.67,N

5. Add a new column called "Luxury Tax" -- if "Peak Season" is "Y", "Luxury Tax" should have a value of 300.00, otherwise, it should have a value of 0.

In [113]:
df["Luxury_Tax"] = np.where(df["Peak Season"] == "Y", 300.00, 0)
df

,Country_Destination,Inclusive,Price_per_Person,Family_Size,Travel_Month,Travel_Insurance,Price_per_Family,Peak Season,Luxury_Tax
0,Barbados,Y,1098.00,2,June,Y,2196.00,Y,300.0
1,Mexico,N,679.99,4,September,Y,2719.96,Y,300.0
2,Australia,Y,2035.69,1,April,Y,2035.69,N,0.0
3,Aruba,Y,1789.00,6,November,Y,10734.00,N,0.0
4,Greece,N,899.00,5,August,Y,4495.00,N,0.0
5,France,Y,1650.89,3,December,Y,4952.67,N,0.0

6. Add a new column called "Total Price" -- add the columns "Price_per_Family" and "Luxury Tax" to get the total price of the trip per family.

In [115]:
df["Total_Price"] = df["Price_per_Family"] * df["Luxury_Tax"]
df

,Country_Destination,Inclusive,Price_per_Person,Family_Size,Travel_Month,Travel_Insurance,Price_per_Family,Peak Season,Luxury_Tax,Total_Price
0,Barbados,Y,1098.00,2,June,Y,2196.00,Y,300.0,658800.0
1,Mexico,N,679.99,4,September,Y,2719.96,Y,300.0,815988.0
2,Australia,Y,2035.69,1,April,Y,2035.69,N,0.0,0.0
3,Aruba,Y,1789.00,6,November,Y,10734.00,N,0.0,0.0
4,Greece,N,899.00,5,August,Y,4495.00,N,0.0,0.0
5,France,Y,1650.89,3,December,Y,4952.67,N,0.0,0.0

# { Module 9 Homework }

1. Import the two libraries needed to work with your dataset.

2. Import the "Dental Patients 2.xlsx" dataset.

3. Explore the characteristics of your dataset. Find the following:
    * the first 5 rows
    * the last 5 rows
    * the shape of the dataset (number of rows and columns)
    * the descriptive statistics for the numeric columns

4. What are the summary characteristics of the dataset? Use the info function to print the details. Jot down two observations you have about this dataset.

5. Locate the columns that have missing data. Which column has the most?

6. Using the column that is missing the most data, locate and return the rows where the data is missing.

7. Using the column that is missing the most data, replace the missing values with "Unknown - Ask Patient".

8. Replace the missing values in the "EmergencyContact" column with "Unknown - Ask Patient".

9. Replace the missing values in the "Age" column with the average age of the dataset.

10. Now that you've filled the missing values for a few rows, drop the remaining rows that have any missing data.

11. Check the dataset for duplicate rows. If you have any, remove them from the dataset.

12. Create a new column called "Flagged" -- this column will let the administration know that they need to contact the patient for more information. If the EmergencyContact column or the Allergies column have the following value "Unknown - Ask Patient" the "Flagged" column should have a value of 1, otherwise, it should have a value of 0.

13. Create a new column called "Overdue Payment" - if the "outstanding balance" column is greater than 0 and the "new patient" column is equal to "N" - the "Overdue Payment" column should have a value of 1, otherwise, it should have a value of 0.

14. Remove the "Insurance" column from the dataset.

15. Export your modified dataset to an excel file called "Dental Patients Updated".